export const MICELIUM_MAP = {
    "а": "👁",
    "б": "🥌",
    "в": "🪾",
    "г": "🚰",
    "д": "🧄",
    "е": "✡️",
    "ё": "🔯",
    "ж": "🫟",
    "и": "🫁",
    "к": "🔌",
    "л": "🫛",
    "м": "🪼",
    "н": "👀",
    "о": "🧿",
    "п": "🦷",
    "с": "🗜️",
    "т": "🎚",
    "у": "🫚",
    "х": "🪬",
    "щ": "🎞️",
    "ъ": "🪑",
    "ь": "💺",
    "э": "🍤"
};

export const VOCABULARYWORDS_MAP = {
    "Александр": "*******",
    "Буква": "з🪾🫚🔌🪾👁️",
    "Глаз": "🚰🫛🧿🗜️🗜️",
    "Зашквар": "з🪼👁️🚰🧄р",
    "Звук": "з🥌🫚🔌",
    "каджаз": "р👁зр👁🥌🧿🎚ч🫁к",
    "Куда": "🔌🫚🧄🫚",
    "Куплинов": "🔌*р🫛🫁👀🧿🪾",
    "Мажор": "🗜️🔌ря🚰👁️",
    "Мажоры": "🗜️🔌ря🚰🫁",
    "Мицелиум": "мiцеlium",
    "Мозг": "з🪼🧿🚰",
    "Паук": "ч🦷🧿🫚�",
    "Пес": "🗜️ы🦷",
    "Псы": "🗜️ы🦷ы",
    "Свадьб": "🗜️🪾👁️🥌🧄",
    "Свин": "🗜️🪾*👀",
    "Собрание": "🗜️✡️й🪼",
    "Спасибо": "з🪼🧿🚰🫁🪼",
    "Ты": "р🎚️ы",
    "Хайп": "🧄р🧿з🧄",
    "Чувак": "ч🫚🪾ч🧿",
    "Яблок": "з🥌🫛🧿🔌"
};

export const REVERSE_MICELIUM_MAP = Object.fromEntries(
    Object.entries(MICELIUM_MAP).map(([char, emoji]) => [emoji, char])
);

export const REVERSE_VOCABULARYWORDS_MAP = Object.fromEntries(
    Object.entries(VOCABULARYWORDS_MAP).map(([word, translate]) => [translate, word])
);
